CSI API ETABS v1
cDatabaseTables.CancelTableEditing Method
 Clears all tables that were stored in the table list using one of the SetTableForEditing... functions.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int CancelTableEditing()
Function CancelTableEditing As Integer
Dim instance As cDatabaseTables
Dim returnValue As Integer
returnValue = instance.CancelTableEditing()
int CancelTableEditing()
abstract CancelTableEditing : unit -> int
Return Value
Type: Int32
Returns 0 if the function executes correctly, otherwise returns nonzero
See Also
Reference
cDatabaseTables Interface
ETABSv1 Namespace